const data = [
    {
      id: 0,
      name: "challenger 2",
      price: "3000000",
      image: "Challenger2.jpg",
      text: "Челленджер 2 (від англ.  Challenger  - суперник, що кидає виклик) - основний бойовий танк сухопутних військ Великобританії .Танки Челленджер 2 застосовувалися під час бойових дій у Косово  та Іраку (з 2003 року по 1 вересня 2010 року).У травні 2009 року BAE Systems оголосила, що згортає виробництво танків даної моделі через відсутність оборонного замовлення з боку уряду Великобританії  . У січні 2023 року адміністрація прем'єр-міністра Ріші Сунака оприлюднила рішення про постачання 14 танків Challenger 2 в Україну .",
    },
    {
      id: 1,
      name: "Leopard2",
      price: "10000000",
      image: "Leopard2.jpg",
      text: "Леопа́рд-2 (  Leopard 2 ) - німецький основний бойовий танк другого покоління. Танк почала розробляти в 1968 році фірма Krauss-Maffei , в 1970 році міністр оборони ФРН Гельмут Шмідт зробив його основою для перспективного бойового танка для бундесверу , в 1972 були побудовані перші прототипи . В 1976 прототип Leopard 2AV проходив порівняльні випробування разом з прототипом XM1 на Абердинському полігоні в США. Перший серійний танк «Леопард-2» було передано німецькій армії 25 жовтня 1979 року. До 2015 року всього було виготовлено понад 3600 танків цього типу.",
    },
    {
      id: 2,
      name: "F-35",
      price: "83000000",
      image: "F-35.jpg",
      text: "Вибір конструкції F- 35  зроблено в 2001 році в результаті конкурсу за програмою JSF ( Joint Strike Fighter  — єдиний ударний винищувач) між компаніями Боїнг (модель X-32 ) і Lockheed Martin (модель X-35). Програма передбачала створення єдиної моделі винищувача для ВПС, ВМС та КМП з можливістю укороченого зльоту, а також вертикального зльоту та посадки для заміни AV-8B , A-10 , F-16 , F/A-18 ; також передбачалася заміна британського Sea Harrier . Третя модель компанії McDonnell Douglas відкинута через складність конструкції.Спільні випробування X-32 та Х-35 показали явну перевагу останнього: він продемонстрував зліт із майданчика довжиною 150 м, розвинув надзвукову швидкість, приземлявся та злітав вертикально. Однією з головних переваг був названий метод створення вертикальної тяги: особливий підйомний вентилятор на X-35, а не відбір потоку повітря зовнішнього контуру основних двигунів, як на X-32, що змушувало встановлювати двигун у центрі мас, а сопла виявлялися близько до повітрозабірників. що призводило до небезпеки попадання в двигун вихлопних газів та значного зменшення тяги.У результаті було вирішено розробити уніфіковані проекти винищувачів-бомбардувальників країн НАТО для базування на суші та на морі. Програму фінансували спільно США та Великобританія (2,5 млрд доларів ), Італія (1,0 млрд доларів), Нідерланди (800 млн доларів), Канада (440 млн доларів), Туреччина (175 млн доларів), Австралія (144 млн доларів). , Норвегія (122 млн доларів) та Данія (110 млн доларів). На розробку та придбання літаків планувалося витратити 233 млрд. доларів, але програма значно затягнулася і вийшла за межі бюджету. За прогнозами, витрати США протягом наступних 15 років складуть 379 млрд доларів. Через високу ціну, велику кількість літаків і планів щодо їх тривалої експлуатації, сумарні витрати на обслуговування і модернізацію F-35 в результаті через 50 років можуть перевищити 1 трлн доларів [11] .Існує три рівні міжнародної участі. Рівні зазвичай відображають фінансову частку у програмі JSF.",
    },
    {
      id: 3,
      name: "F-22 Raptor",
      price: "352000000",
      image: "F-22.jpg",
      text: "Lockheed Martin F-22 Raptor англ.  Raptor - Хижий птах  - малопомітний багатоцільовий винищувач  п'ятого покоління , розроблений компаніями Lockheed Martin , Boeing і General Dynamics для боротьби з авіацією противника, прикриття військ і тилових об'єктів від ударів з повітря, протидії повітряній розвідці супротивника вдень і вночі, у простих та складних метеоумовах. F-22 є першим винищувачем п'ятого покоління, що стоїть на озброєнні.",
    },
    {
      id: 4,
      name: "R-360 Neptun",
      price: "4000000",
      image: "Neptune.jpg",
      text: "Р-360 «Нептун» ( укр . Р-360 «Нептун» , .  Р-360 «Нептун» ) — українська дозвукова крилата всепогодна ракета, розроблена київським КБ «Луч» . Спочатку розроблена як протикорабельна ракета , у 2023 році була представлена ​​альтернативна модель з новою системою наведення для підтримки завдань наземного нападу. Маючи радіус дії понад 200 кілометрів, він призначений для нейтралізації морських цілей вагою до 9000 тонн."
    },
    {
      id: 5,
      name: "Storm-Shadow",
      price: "850000",
      image: "SSH.jpg",
      text: "Storm Shadow / SCALP-EG  - англо-французька малопомітна крилата ракета великої дальності повітряного базування, що розробляється з 1994 року компаніями Matra і British Aerospace , а в даний час виробляється MBDA . Storm Shadow – британська назва ракети. Французький варіант ракети позначається абревіатурою SCALP -EG ( франц  . Ракета створена на основі розробленої у Франції крилатої протиракети Apache. Вони відрізняються тим, що Storm Shadow несе боєголовку замість суббоєприпасів ."

        
    },
    {
      id: 6,
      name: "Atacams",
      price: "2500000",
      image: "Atacams.jpg",
      text: "ATACMS ( англ.  A rmy TAC tical M issile S ystem , дослівно  - «Армійський тактичний ракетний комплекс») - твердопаливна тактична балістична ракета класу земля - ​​земля , вироблена американською компанією Lockheed Martin . Має дальність застосування до 300 км [3] . Її різні варіанти оснащення носять індекси МО США MGM-140, MGM-164 та MGM-168. Ракета ATACMS у транспортно-пусковому контейнері має індекс М39 .Пусковими установками ракет ATACMS є реактивні системи залпового вогню M270 MLRS та M142 HIMARS .",
    },
    {
      id: 7,
      name: "T-64- Bulat",
      price: "2000000",
      image: "T-64.jpg",
      text: "Т-64 БМ «Була́т» — український основний бойовий танк, який є модернізацією радянського танка Т-64БВ. Модернізація включала посилення захисту корпусу і башти динамічним захистом «Ніж», більш потужний двигун, а також низку інших удосконалень.",
    },
    {
      id: 8,
      name: "T-84BM-Oplot",
      price: "2500000",
      image: "Oplot.jpg",
      text: "БМ Оплот Об'єкт 478ДУ9-1, Оплот-М  - сучасний український основний бойовий танк, розроблений Харківським конструкторським бюро машинобудування. Головний конструктор машини - Михайло Дем'янович Борисюк .",
    },
  ];
  
  export default data;